'''Напишите программу, которая печатает цифры в диапазоне [1...1000],
которые заканчиваются на 7:
'''
for i in range(7,1000,10):
    print(i)