# 5.3
# Сделайте массив из четверостиший любого стихотворения и выведите их с отступом в 1 строку
# Пример:
# [
#   'Я помню чудное мгновенье:
#   Передо мной явилась ты,
#   Как мимолетное виденье,
#   Как гений чистой красоты.'
#
#   'В томленьях грусти безнадежной,
#   В тревогах шумной суеты,
#   Звучал мне долго голос нежный
#   И снились милые черты.'
# ]
a = ['Душе настало пробужденье:', 'И вот опять явилась ты,', 'Как мимолетное виденье,', 'Как гений чистой красоты.',
     'И сердце бьется в упоенье,', 'И для него воскресли вновь', 'И божество, и вдохновенье,',
     'И жизнь, и слезы, и любовь.']
for i in a:
    print(i)
