'''Программа получает 2*n чисел (где n – количество пар). Первое и второе
число образуют пару, третье и четвертое тоже и т.д. Каждая пара имеет
значение - сумму составляющих ее чисел. Напишите программу, которая
проверяет, имеют ли все пары одинаковое значение или печатает
максимальную разницу между двумя последовательными парами. Если все
пары имеют одинаковое значение, выведите «Yes, value = {Value}», где
{Value} – значение суммы. В противном случае распечатайте "No, maxdiff =
{Difference}", где {Difference} – значение максимальной разницы между
последовательными суммами'''
kolvopar = int(input('введите кол-во пар:'))
maxsuma = -100000000000000
minsuma = 1000000000000000
for i in range(kolvopar):
    a = int(input('введите число:'))
    a += int(input('введите число:'))
    if maxsuma < a:
        maxsuma = a
    if minsuma > a:
        minsuma = a
if maxsuma == minsuma:
    print('Yes, value=', minsuma)
else:
    print('No, maxdiff=', maxsuma - minsuma)
