'''
Напишите консольную программу, которая переводит значения из рублей
в доллары по курсу 68.33.
Примеры ввода и вывода:
'''
print('введите кол-во $:')
dol = int(input())
print('кол-во рублей:', dol * 68.33)
